export const supportMock = [
  {
    id: 1,
    customer: "سارة أحمد",
    title: "مشكلة في إتمام الطلب",
    message: "واجهت مشكلة أثناء محاولة إتمام الطلب رقم 102.",
    date: "2025-05-20",
    status: "جديدة",
  },
  {
    id: 2,
    customer: "محمد الطيب",
    title: "تأخر مقدم الخدمة",
    message: "مقدم الخدمة تأخر عن الموعد المحدد.",
    date: "2025-05-21",
    status: "قيد المراجعة",
  },
  {
    id: 3,
    customer: "منى خالد",
    title: "خدمة غير مرضية",
    message: "الخدمة لم تكن بالمستوى المطلوب.",
    date: "2025-05-22",
    status: "مغلقة",
  },
  {
    id: 4,
    customer: "أحمد يوسف",
    title: "خطأ في الفاتورة",
    message: "تم احتساب مبلغ إضافي غير صحيح.",
    date: "2025-05-23",
    status: "جديدة",
  },
];
